function Exam(question , answer) {
    this.question = question;
    this.answer = answer;

} //class

  arr = [];



  arr[0] = new Exam( 'شهيتي لطعام جيدة' , 'no'  );
  arr[1] = new Exam( 'من السهل أن توقظني الاصوات من النوم' , 'yes'  );
  arr[2] = new Exam( 'حياتي اليومية مليئة بما يثير إهتمامي' , 'no'  );
  arr[3] = new Exam( ' قدرتي علي العمل ثابتة لم تتغير عما كانت عليه من قبل' , 'no'  );
  arr[4] = new Exam( "قليلا ما اصاب بالامساك " , 'no' );

  arr[5] = new Exam( ' اشعر احيانا برغبة في السب' , 'no'  );
  arr[6] = new Exam(   "اجد من الصعوبة ان اركز ذهني في عمل او مهمة"  , 'yes'  );
  arr[7] = new Exam( 'قليلا ما ينتابني القلق علي صحتي' , 'no'  );
  arr[8] = new Exam( ' اشعر احيانا برغبة في تحطيم الاشياء ' , 'no'  );
  arr[9] = new Exam( "مرت بي فترات فقدت بها القدرة علي الإهتمام بما حولي  " , 'yes' );

  arr[10] = new Exam( ' نومي مضطرب و قلق' , 'yes'  );
  arr[11] = new Exam(   "حكمي علي الامور الان افضل منه في اي وقت مضي"  , 'no'  );
  arr[12] = new Exam( 'صحتي الجسمية كصحة معظم اصدقائي في الجودة ' , 'no'  );
  arr[13] = new Exam( '  افضل ان اتجاهل المعارف الذين لم اراهم منذ مدة طويلة الا إذا بادروني هم بالكلام ' , 'yes'  );
  arr[14] = new Exam( " انني سهل الاختلاط بالناس " , 'no' );

  arr[15] = new Exam( 'اعتقد ان كل شئ يحدث وفقا لما ذكره الانبياء والرسل ' , 'no'  );
  arr[16] = new Exam(   "اثابر احيانا علي القيام بعمل الي ان يفقد الاخرون صبرهم معي"  , 'no'  );
  arr[17] = new Exam( ' اتمني لو كنت سعيدا كما يبدو الاخرين ' , 'yes'  );
  arr[18] = new Exam( " اعاكس والاعب الحيوانات احيانا " , 'no' );
  arr[19] = new Exam( 'من المؤكد انني قليل الثقة بالنفس ' , 'yes'  );

  arr[20] = new Exam( 'اشعر بشكل عام ان الحياة لها قيمة ' , 'no'  );
  arr[21] = new Exam(   "اقناع الناس بالصواب يتطلب مجهودا كبيرا"  , 'no'  );
  arr[22] = new Exam( ' اتردد علي اماكن العبادة كل اسبوع تقريبا ' , 'no'  );
  arr[23] = new Exam( " مؤمن بمجئ  المهدي المنتظر او عودة المسيح " , 'no' );
  arr[24] = new Exam( 'يبدو انني لا هتم بما يحدث لي ' , 'yes'  );

  arr[25] = new Exam( 'اشعر بالسعادة معظم الاوقات ' , 'no'  );
  arr[26] = new Exam(   "يبدو انني لا اقل نباهة او قدرة عن معظم الناس المحيطين بي"  , 'no'  );
  arr[27] = new Exam( 'لم يحدث ان تقيأت دما او سعلت دم ' , 'yes'  );
  arr[28] = new Exam( ' لا تقلقني فكرة الاصابة بالمرض ' , 'no'  );
  arr[29] = new Exam( " النقد و اللوم يجرحان شعوري الي حد كبير " , 'yes' );

  arr[30] = new Exam( 'اشعر في بعض لاحيان شعورا قويا انني عديم الفائدة ' , 'yes'  );
  arr[31] = new Exam(   "اشعر احيانا برغبة في الاشتبك بالايدي مع اي شخص"  , 'no'  );
  arr[32] = new Exam( ' انام في معظم لايام دون ان تضايقني الافكار ' , 'no'  );
  arr[33] = new Exam( " لم اصب بأي نوبة مزاجية تقريبا " , 'no' );
  arr[34] = new Exam( 'وزني لا يزيد ولا ينقص ' , 'no'  );

  arr[35] = new Exam( 'ابكي بسهولة ' , 'yes'  );
  arr[36] = new Exam(   "لم اعد افهم ما اقرأ بنفس الدرجة التي كنت افهم بها سابقا"  , 'yes'  );
  arr[37] = new Exam( ' لم اشعر يوما بانني احسن مما انا عليه الان ' , 'no'  );
  arr[38] = new Exam( " يبدو ان ذاكرتي لا بأس بها " , 'no' );
  arr[39] = new Exam( 'اخاف ان افقد صوابي ' , 'no'  );

  arr[40] = new Exam( 'انني ضد مسألة اعطاء النقود لشحاذين ' , 'yes'  );
  arr[41] = new Exam(   "اشعر في معظم الاوقت بضعف عام"  , 'yes'  );
  arr[42] = new Exam( 'انني اتصبب عرقا عندما احرج في بعض الاوقات ' , 'no'  );
  arr[43] = new Exam( " لم يحدث ان وجدت صعوبة في حفظ توازني في المشي " , 'yes' );
  arr[44] = new Exam( 'لا اشكو من نوبات ربو او نوبات زكام' , 'no'  );

  arr[45] = new Exam( 'اجد متعة في انواع كثيرة من الالعاب ووسائل الترويح ' , 'no'  );
  arr[46] = new Exam(   "احب ان اغازل الجنس الاخر"  , 'no'  );
  arr[47] = new Exam( " كثيرا ما استغرق في التفكير " , 'yes' );
  arr[48] = new Exam( 'احلم عادة باشياء افضل ان احتفظ بها لنفسي  ' , 'no'  );
  
  arr[49] = new Exam( 'لست عصبيا بدرجة اكبر مما يبدو عليه معظم الناس  ' , 'no'  );
  arr[50] = new Exam(   "احيانا اشعر بانشراح وسعادة بدون سبب حتي لو كانت الامور علي غير ما اشتهي"  , 'no'  );
  arr[51] = new Exam( ' اجد من الصعب علي  ان ابدا عملا من الاعمال ' , 'yes'  );
  arr[52] = new Exam( " عندما اغادر المنزل لا ينتابني الضيق او الشك ان اكون تركت النوافذ مفتوحة او الباب غير مغلق " , 'no' );
  arr[53] = new Exam( 'انني لا الوم اي شخص يستغل من يعرض نفسه للاستغلال ' , 'no'  );
  
  
  arr[54] = new Exam( 'اشعر في بعض الاحيان انني مملوء نشاطا ' , 'no'  );
  arr[55] = new Exam(   "اضحك احيانا علي النكت التي تخرج عن حدود اللياقة"  , 'no'  );
  arr[56] = new Exam( ' تزعجني نوبات من الاغماء والقئ ' , 'yes'  );
  arr[57] = new Exam( " انني اعمل تحت توتر عصبي عنيف " , 'yes' );
  arr[58] = new Exam( 'اتمني الموت في معظم الاحيان ' , 'yes'  );
  arr[59] = new Exam( ' احيانا ما اعترضت طريق بعض لناس ومنعتهم  من القيام بأعمال معينه لا لشئ الا المبدأ ' , 'no'  );
  
  
  
  
  
  
  

  
  
  
  


